# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи — первые буквы имён,
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'],
# 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


def gen_dict(user_list):
    new_dict = {}
    for elem in sorted(user_list):
        key = elem[0]
        if key not in new_dict:
            new_dict[key] = [elem]
        else:
            new_dict[key].append(elem)

    return new_dict


name_list = ["Иван", "Мария", "Петр", "Илья",
             "Марина", "Петр", "Алина", "Бибочка"]
print(name_list)
result = gen_dict(name_list)
print(result)
